perf/exponential.yaml
config:
  target: 'http://localhost:5555'
  plugins:
    statsd:
      host: localhost
      port: 8125
      prefix: "artillery-exponential"
  pool: 50
  phases:
    # Start with 1 user per second and exponentially increase
    - name: Exponential Phase 1
      duration: 30
      arrivalRate: 1
      rampTo: 2
    - name: Exponential Phase 2
      duration: 30
      arrivalRate: 2
      rampTo: 4
    - name: Exponential Phase 3
      duration: 30
      arrivalRate: 4
      rampTo: 8
    - name: Exponential Phase 4
      duration: 30
      arrivalRate: 8
      rampTo: 16
    - name: Exponential Phase 5
      duration: 30
      arrivalRate: 16
      rampTo: 32
    - name: Exponential Phase 6
      duration: 30
      arrivalRate: 32
      rampTo: 64
    - name: Exponential Phase 7
      duration: 30
      arrivalRate: 64
      rampTo: 128
    - name: Exponential Phase 8
      duration: 30
      arrivalRate: 128
      rampTo: 256

scenarios:
  - name: Exponential Load Test (/exchange)
    flow:
      - post:
          url: '/exchange'
          json:
            baseCurrency: 'ARS'
            counterCurrency: 'USD'
            baseAccountId: 1
            counterAccountId: 2
            baseAmount: 50
      - think: 1