perf/spike.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
  
  pool: 100
  phases:
    - name: "Baseline"
      duration: 60
      arrivalRate: 50
    - name: "Sudden Spike"
      duration: 30
      arrivalRate: 256
    - name: "Recovery"
      duration: 15
      arrivalRate: 50
    - name: "Sudden Spike 2"
      duration: 30
      arrivalRate: 256
    - name: "Recovery 2"
      duration: 15
      arrivalRate: 50

scenarios:
  - name: "Spike Test"
    flow:
      - get:
          url: '/rates'
      - post:
          url: '/exchange'
          json:
            baseCurrency: 'ARS'
            counterCurrency: 'USD'
            baseAccountId: 1
            counterAccountId: 2
            baseAmount: 50
      - think: 1